app/Controllers/FormController.php

INSERT INTO `dewasa` (`nama_lengkap`, `jenis_kelamin`, `jenis_pemohon_paspor`, `tempat_lahir`, `tanggal_lahir`, `nik`, `tempat_dikeluarkan_ktp`, `alamat`, `no_hp`, `nama_ibu`, `nama_ayah`, `tujuan_pengajuan`, `status_sipil`, `pekerjaan`) VALUES ('AA', 'LAKI-LAKI', 'A', 'A', '2025-01-08', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'BELUM MENIKAH', 'A')
---
    public function saveDewasa()
    {
        $model = new DewasaModel();

        $data = [
            'type' => 'dewasa',
            'nama_lengkap' => strtoupper($this->request->getPost('nama_lengkap')),
            'jenis_kelamin' => strtoupper($this->request->getPost('jenis_kelamin')),
            'jenis_pemohon_paspor' => strtoupper($this->request->getPost('jenis_pemohon_paspor')),
            'tempat_lahir' => strtoupper($this->request->getPost('tempat_lahir')),
            'tanggal_lahir' => strtoupper($this->request->getPost('tanggal_lahir')),
            'nik' => strtoupper($this->request->getPost('nik')),
            'tempat_dikeluarkan_ktp' => strtoupper($this->request->getPost('tempat_dikeluarkan_ktp')),
            'alamat' => strtoupper($this->request->getPost('alamat')),
            'no_hp' => strtoupper($this->request->getPost('no_hp')),
            'nama_ibu' => strtoupper($this->request->getPost('nama_ibu')),
            'nama_ayah' => strtoupper($this->request->getPost('nama_ayah')),
            'tujuan_pengajuan' => strtoupper($this->request->getPost('tujuan_pengajuan')),
            'status_sipil' => strtoupper($this->request->getPost('status_sipil')),
            'pekerjaan' => strtoupper($this->request->getPost('pekerjaan')),
        ];

        $id = $model->insert($data);

SELECT *
FROM `dewasa`
WHERE `dewasa`.`id` = '54'
---
    public function printDewasaAuto($id = null)
    {
        $model = new DewasaModel();
        $data = $model->find($id);